In [6]:
import numpy as np
import pandas as pd

In [7]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [8]:
df = pd.DataFrame(students)

In [9]:
df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [10]:
df.set_index("student_number", inplace=True) #güncelledik.

# Filtering

* Pandas'ta filtreleme mantığı numpy'da gördüğümüz filtreleme mantığı ile paralel olacak

In [11]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [12]:
df["last_name"]

student_number
101      Brown
403    Bradley
202     Hughes
1        James
Name: last_name, dtype: object

In [13]:
df["last_name"] == "Brown"

student_number
101     True
403    False
202    False
1      False
Name: last_name, dtype: bool

* Nasıl ki numpy bana böyle bir karşılaştırmanın sonucunu boolean'lardan oluşan bir array olarak veriyordu, pandas da bana cevabı boolean'lardan oluşan bir Series olarak veriyor.

* Bunu bir variable'a eşitleyip bir soyutlama gerçekleştirebiliriz

In [14]:
filt = (df["last_name"] == "Brown")

In [15]:
df[filt] # df[df["last_name"] == "Brown"]

                  name last_name  age
student_number
101             Finley     Brown   23

In [12]:
df.loc[filt]

                  name last_name  age
student_number
101             Finley     Brown   23

In [17]:
df.loc[[True,False,False,True]]

                  name last_name  age
student_number
101             Finley     Brown   23
1                Denis     James   24

In [14]:
df.iloc[[True,False,False,True]]

                  name last_name  age
student_number
101             Finley     Brown   23
1                Denis     James   24

In [15]:
df.loc[[True,False,False]]

IndexError: Boolean index has wrong length: 3 instead of 4

## Filtering - Belirli Column(lara) Ulaşmak

In [16]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [18]:
filt = (df["last_name"] == "Brown")

In [19]:
df.loc[filt, "name"]

student_number
101    Finley
Name: name, dtype: object

In [21]:
df.loc[filt, ["age", "name"]]

                age    name
student_number
101              23  Finley

## & and | ile filtreleme

In [20]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "Brown"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [47]:
df = pd.DataFrame(students)

In [48]:
df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     Brown   24               1

In [25]:
df.set_index("student_number", inplace=True)

In [26]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     Brown   24

In [27]:
df[df["last_name"] == "Brown"]

                  name last_name  age
student_number
101             Finley     Brown   23
1                Denis     Brown   24

In [28]:
filt = (df["last_name"] == "Brown") & (df["name"] == "Finley")

In [29]:
filt

student_number
101     True
403    False
202    False
1      False
dtype: bool

In [20]:
df[filt]

                  name last_name  age
student_number
101             Finley     Brown   23

In [21]:
df.loc[filt, ["age","name"]]

                age    name
student_number
101              23  Finley

In [22]:
df.iloc[filt, [2, 0]]

NotImplementedError: iLocation based boolean indexing on an integer type is not available

In [13]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [14]:
filt = (df["name"] == "Andrew") | (df["last_name"] == "Hughes")

In [15]:
filt

student_number
101    False
403     True
202     True
1      False
dtype: bool

In [39]:
df.loc[filt, ["age","name"]]

                age    name
student_number
403              21  Andrew
202              34   Blake

## Opposite Filter

In [21]:
df

                  name last_name  age
student_number
101             Finley     Brown   23
403             Andrew   Bradley   21
202              Blake    Hughes   34
1                Denis     James   24

In [22]:
filt = ~((df["name"] == "Andrew") | (df["last_name"] == "Hughes"))

In [23]:
df.loc[filt, ["age","name"]]

                age    name
student_number
101              23  Finley
1                24   Denis